DanielMartensson/STM32-PLC/PLC STM32.ioc
RCC.PLLCLKFreq_Value=48000000
RCC.PLLMCOFreq_Value=24000000
RCC.PLLMUL=RCC_PLL_MUL6
RCC.PWRFreq_Value=48000000
RCC.RTCFreq_Value=40000
RCC.RTCHSEDivFreq_Value=250000
RCC.SDADCPresc=RCC_SDADCSYSCLK_DIV8
RCC.SDADCoutputFreq_Value=6000000
RCC.SYSCLKFreq_VALUE=48000000
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
RCC.TIM2Freq_Value=48000000
RCC.USART1Freq_Value=48000000
RCC.USART2Freq_Value=24000000
RCC.USART3Freq_Value=24000000
RCC.USBFreq_Value=48000000
RCC.VCOOutput2Freq_Value=8000000
RTC.Alarm-Alarm\ A=RTC_ALARM_A
RTC.AlarmDateWeekDaySel-Alarm\ A=RTC_ALARMDATEWEEKDAYSEL_DATE
RTC.AlarmDateWeekDaySel_B-Alarm\ B=RTC_ALARMDATEWEEKDAYSEL_WEEKDAY
RTC.Alarm_B-Alarm\ B=RTC_ALARM_B
RTC.Format=RTC_FORMAT_BIN
RTC.IPParameters=Format,Alarm-Alarm A,AlarmDateWeekDaySel-Alarm A,Alarm_B-Alarm B,AlarmDateWeekDaySel_B-Alarm B
SDADC1.CommonMode0=SDADC_COMMON_MODE_VSSA
SDADC1.EnableInjectedConversion=ENABLE
SDADC1.EnableRegularconversion=DISABLE
SDADC1.Gain1=SDADC_GAIN_1
SDADC1.Gain2=SDADC_GAIN_1
SDADC1.IPParameters=NbrOfConversionFlag,InputMode0,EnableRegularconversion,EnableInjectedConversion,InjectedContinuousMode,InjectedRank-11\#ChannelInjectedConversion,InjectedChannel-11\#ChannelInjectedConversion,InjectedConfIndex-11\#ChannelInjectedConversion,InjNumberOfConversion,InjectedTrigger,InjectedRank-20\#ChannelInjectedConversion,InjectedConfIndex-20\#ChannelInjectedConversion,InjectedChannel-20\#ChannelInjectedConversion,InjectedRank-21\#ChannelInjectedConversion,InjectedConfIndex-21\#ChannelInjectedConversion,InjectedChannel-21\#ChannelInjectedConversion,InjectedRank-22\#ChannelInjectedConversion,InjectedConfIndex-22\#ChannelInjectedConversion,InjectedChannel-22\#ChannelInjectedConversion,InjectedRank-23\#ChannelInjectedConversion,InjectedConfIndex-23\#ChannelInjectedConversion,InjectedChannel-23\#ChannelInjectedConversion,InjectedRank-24\#ChannelInjectedConversion,InjectedConfIndex-24\#ChannelInjectedConversion,InjectedChannel-24\#ChannelInjectedConversion,InjectedRank-25\#ChannelInjectedConversion,InjectedConfIndex-25\#ChannelInjectedConversion,InjectedChannel-25\#ChannelInjectedConversion,InjectedRank-26\#ChannelInjectedConversion,InjectedConfIndex-26\#ChannelInjectedConversion,InjectedChannel-26\#ChannelInjectedConversion,InjectedRank-27\#ChannelInjectedConversion,InjectedConfIndex-27\#ChannelInjectedConversion,InjectedChannel-27\#ChannelInjectedConversion,CommonMode0,InjectedChannelsSelection,InputMode1,InputMode2,Gain1,Gain2,InjDelay
SDADC1.InjDelay=Disable
SDADC1.InjNumberOfConversion=9
SDADC1.InjectedChannel-11\#ChannelInjectedConversion=SDADC_CHANNEL_0
SDADC1.InjectedChannel-20\#ChannelInjectedConversion=SDADC_CHANNEL_1
SDADC1.InjectedChannel-21\#ChannelInjectedConversion=SDADC_CHANNEL_2
SDADC1.InjectedChannel-22\#ChannelInjectedConversion=SDADC_CHANNEL_3
SDADC1.InjectedChannel-23\#ChannelInjectedConversion=SDADC_CHANNEL_4
SDADC1.InjectedChannel-24\#ChannelInjectedConversion=SDADC_CHANNEL_5
SDADC1.InjectedChannel-25\#ChannelInjectedConversion=SDADC_CHANNEL_6
SDADC1.InjectedChannel-26\#ChannelInjectedConversion=SDADC_CHANNEL_7
SDADC1.InjectedChannel-27\#ChannelInjectedConversion=SDADC_CHANNEL_8
SDADC1.InjectedChannelsSelection=SDADC_CHANNEL_0|SDADC_CHANNEL_1|SDADC_CHANNEL_2|SDADC_CHANNEL_3|SDADC_CHANNEL_4|SDADC_CHANNEL_5|SDADC_CHANNEL_6|SDADC_CHANNEL_7|SDADC_CHANNEL_8
SDADC1.InjectedConfIndex-11\#ChannelInjectedConversion=SDADC_CONF_INDEX_0
SDADC1.InjectedConfIndex-20\#ChannelInjectedConversion=SDADC_CONF_INDEX_0
SDADC1.InjectedConfIndex-21\#ChannelInjectedConversion=SDADC_CONF_INDEX_0
SDADC1.InjectedConfIndex-22\#ChannelInjectedConversion=SDADC_CONF_INDEX_1
SDADC1.InjectedConfIndex-23\#ChannelInjectedConversion=SDADC_CONF_INDEX_1
SDADC1.InjectedConfIndex-24\#ChannelInjectedConversion=SDADC_CONF_INDEX_1
SDADC1.InjectedConfIndex-25\#ChannelInjectedConversion=SDADC_CONF_INDEX_2
SDADC1.InjectedConfIndex-26\#ChannelInjectedConversion=SDADC_CONF_INDEX_2
SDADC1.InjectedConfIndex-27\#ChannelInjectedConversion=SDADC_CONF_INDEX_2
SDADC1.InjectedContinuousMode=SDADC_CONTINUOUS_CONV_ON
SDADC1.InjectedRank-11\#ChannelInjectedConversion=1
SDADC1.InjectedRank-20\#ChannelInjectedConversion=2
SDADC1.InjectedRank-21\#ChannelInjectedConversion=3
SDADC1.InjectedRank-22\#ChannelInjectedConversion=4
SDADC1.InjectedRank-23\#ChannelInjectedConversion=5
SDADC1.InjectedRank-24\#ChannelInjectedConversion=6
SDADC1.InjectedRank-25\#ChannelInjectedConversion=7
SDADC1.InjectedRank-26\#ChannelInjectedConversion=8
SDADC1.InjectedRank-27\#ChannelInjectedConversion=9
SDADC1.InjectedTrigger=SDADC_EXTERNAL_TRIGGER
SDADC1.InputMode0=SDADC_INPUT_MODE_SE_ZERO_REFERENCE
SDADC1.InputMode1=SDADC_INPUT_MODE_SE_ZERO_REFERENCE
SDADC1.InputMode2=SDADC_INPUT_MODE_SE_ZERO_REFERENCE
SDADC1.NbrOfConversionFlag=1
SDADC2.EnableInjectedConversion=ENABLE
SDADC2.EnableRegularconversion=DISABLE
SDADC2.IPParameters=NbrOfConversionFlag,EnableRegularconversion,EnableInjectedConversion,InjectedRank-0\#ChannelInjectedConversion,InjectedChannel-0\#ChannelInjectedConversion,InjectedConfIndex-0\#ChannelInjectedConversion,InjNumberOfConversion,InjectedTrigger,InjectedContinuousMode,InjectedRank-3\#ChannelInjectedConversion,InjectedConfIndex-3\#ChannelInjectedConversion,InjectedChannel-3\#ChannelInjectedConversion,InjectedRank-4\#ChannelInjectedConversion,InjectedConfIndex-4\#ChannelInjectedConversion,InjectedChannel-4\#ChannelInjectedConversion,InputMode2,InjectedChannelsSelection,InputMode0,InputMode1,InjDelay,InjectedExtTrigger
SDADC2.InjDelay=Disable
SDADC2.InjNumberOfConversion=3
SDADC2.InjectedChannel-0\#ChannelInjectedConversion=SDADC_CHANNEL_0
SDADC2.InjectedChannel-3\#ChannelInjectedConversion=SDADC_CHANNEL_1
SDADC2.InjectedChannel-4\#ChannelInjectedConversion=SDADC_CHANNEL_2
SDADC2.InjectedChannelsSelection=SDADC_CHANNEL_0|SDADC_CHANNEL_1|SDADC_CHANNEL_2
SDADC2.InjectedConfIndex-0\#ChannelInjectedConversion=SDADC_CONF_INDEX_0
SDADC2.InjectedConfIndex-3\#ChannelInjectedConversion=SDADC_CONF_INDEX_1
SDADC2.InjectedConfIndex-4\#ChannelInjectedConversion=SDADC_CONF_INDEX_2
SDADC2.InjectedContinuousMode=SDADC_CONTINUOUS_CONV_ON
SDADC2.InjectedExtTrigger=SDADC_EXT_TRIG_TIM12_CC1
SDADC2.InjectedRank-0\#ChannelInjectedConversion=1
SDADC2.InjectedRank-3\#ChannelInjectedConversion=2
SDADC2.InjectedRank-4\#ChannelInjectedConversion=3
SDADC2.InjectedTrigger=SDADC_EXTERNAL_TRIGGER
SDADC2.InputMode0=SDADC_INPUT_MODE_SE_ZERO_REFERENCE
SDADC2.InputMode1=SDADC_INPUT_MODE_SE_ZERO_REFERENCE
SDADC2.InputMode2=SDADC_INPUT_MODE_SE_ZERO_REFERENCE
SDADC2.NbrOfConversionFlag=1
SDADC3.EnableInjectedConversion=ENABLE
SDADC3.EnableRegularconversion=DISABLE
SDADC3.IPParameters=NbrOfConversionFlag,EnableRegularconversion,EnableInjectedConversion,InjectedRank-0\#ChannelInjectedConversion,InjectedChannel-0\#ChannelInjectedConversion,InjectedConfIndex-0\#ChannelInjectedConversion,InjNumberOfConversion,InjectedTrigger,InjectedContinuousMode,InjectedRank-5\#ChannelInjectedConversion,InjectedConfIndex-5\#ChannelInjectedConversion,InjectedChannel-5\#ChannelInjectedConversion,InjectedRank-6\#ChannelInjectedConversion,InjectedConfIndex-6\#ChannelInjectedConversion,InjectedChannel-6\#ChannelInjectedConversion,InjectedRank-7\#ChannelInjectedConversion,InjectedConfIndex-7\#ChannelInjectedConversion,InjectedChannel-7\#ChannelInjectedConversion,InjectedRank-8\#ChannelInjectedConversion,InjectedConfIndex-8\#ChannelInjectedConversion,InjectedChannel-8\#ChannelInjectedConversion,InjectedChannelsSelection,InjDelay,InjectedExtTrigger
SDADC3.InjDelay=Disable
SDADC3.InjNumberOfConversion=5
SDADC3.InjectedChannel-0\#ChannelInjectedConversion=SDADC_CHANNEL_0
SDADC3.InjectedChannel-5\#ChannelInjectedConversion=SDADC_CHANNEL_2
SDADC3.InjectedChannel-6\#ChannelInjectedConversion=SDADC_CHANNEL_4
SDADC3.InjectedChannel-7\#ChannelInjectedConversion=SDADC_CHANNEL_6
SDADC3.InjectedChannel-8\#ChannelInjectedConversion=SDADC_CHANNEL_8
SDADC3.InjectedChannelsSelection=SDADC_CHANNEL_0|SDADC_CHANNEL_2|SDADC_CHANNEL_4|SDADC_CHANNEL_6|SDADC_CHANNEL_8
SDADC3.InjectedConfIndex-0\#ChannelInjectedConversion=SDADC_CONF_INDEX_0
SDADC3.InjectedConfIndex-5\#ChannelInjectedConversion=SDADC_CONF_INDEX_0
SDADC3.InjectedConfIndex-6\#ChannelInjectedConversion=SDADC_CONF_INDEX_1
SDADC3.InjectedConfIndex-7\#ChannelInjectedConversion=SDADC_CONF_INDEX_1
SDADC3.InjectedConfIndex-8\#ChannelInjectedConversion=SDADC_CONF_INDEX_2
SDADC3.InjectedContinuousMode=SDADC_CONTINUOUS_CONV_ON
SDADC3.InjectedExtTrigger=SDADC_EXT_TRIG_TIM12_CC2
SDADC3.InjectedRank-0\#ChannelInjectedConversion=1
SDADC3.InjectedRank-5\#ChannelInjectedConversion=2
SDADC3.InjectedRank-6\#ChannelInjectedConversion=3
SDADC3.InjectedRank-7\#ChannelInjectedConversion=4
SDADC3.InjectedRank-8\#ChannelInjectedConversion=5
SDADC3.InjectedTrigger=SDADC_EXTERNAL_TRIGGER
SDADC3.NbrOfConversionFlag=1
SH.COMP_DAC11_group.0=DAC1_OUT1,DAC_OUT1
SH.COMP_DAC11_group.ConfNb=1
SH.COMP_DAC12_group.0=DAC1_OUT2,Enable_DAC_OUT2
SH.COMP_DAC12_group.ConfNb=1
SH.COMP_DAC21_group.0=DAC2_OUT1,DAC_OUT1
SH.COMP_DAC21_group.ConfNb=1
SH.S_TIM16_CH1.0=TIM16_CH1,Input_Capture1_from_TI1
SH.S_TIM16_CH1.ConfNb=1
SH.S_TIM17_CH1.0=TIM17_CH1,Input_Capture1_from_TI1
SH.S_TIM17_CH1.ConfNb=1
SH.S_TIM19_CH1.0=TIM19_CH1,Encoder_Interface
SH.S_TIM19_CH1.ConfNb=1
SH.S_TIM19_CH2.0=TIM19_CH2,Encoder_Interface
SH.S_TIM19_CH2.ConfNb=1
SH.S_TIM2_CH1_ETR.0=TIM2_CH1,PWM Generation1 CH1
SH.S_TIM2_CH1_ETR.ConfNb=1
SH.S_TIM2_CH2.0=TIM2_CH2,PWM Generation2 CH2
SH.S_TIM2_CH2.ConfNb=1
SH.S_TIM2_CH3.0=TIM2_CH3,PWM Generation3 CH3
SH.S_TIM2_CH3.ConfNb=1
SH.S_TIM2_CH4.0=TIM2_CH4,PWM Generation4 CH4
SH.S_TIM2_CH4.ConfNb=1
SH.S_TIM4_CH1.0=TIM4_CH1,Encoder_Interface
SH.S_TIM4_CH1.ConfNb=1
SH.S_TIM4_CH2.0=TIM4_CH2,Encoder_Interface
SH.S_TIM4_CH2.ConfNb=1
SH.S_TIM5_CH1_ETR.0=TIM5_CH1,PWM Generation1 CH1
SH.S_TIM5_CH1_ETR.ConfNb=1
SH.S_TIM5_CH2.0=TIM5_CH2,PWM Generation2 CH2
SH.S_TIM5_CH2.ConfNb=1
SH.S_TIM5_CH3.0=TIM5_CH3,PWM Generation3 CH3
SH.S_TIM5_CH3.ConfNb=1
SH.S_TIM5_CH4.0=TIM5_CH4,PWM Generation4 CH4
SH.S_TIM5_CH4.ConfNb=1
SPI1.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_4
SPI1.CalculateBaudRate=12.0 MBits/s
SPI1.DataSize=SPI_DATASIZE_8BIT
SPI1.Direction=SPI_DIRECTION_2LINES
SPI1.IPParameters=VirtualType,Mode,Direction,BaudRatePrescaler,CalculateBaudRate,DataSize
SPI1.Mode=SPI_MODE_MASTER
SPI1.VirtualType=VM_MASTER
SPI2.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_256
SPI2.CLKPhase=SPI_PHASE_1EDGE
SPI2.CLKPolarity=SPI_POLARITY_LOW
SPI2.CalculateBaudRate=93.75 KBits/s
SPI2.DataSize=SPI_DATASIZE_8BIT
SPI2.Direction=SPI_DIRECTION_2LINES
SPI2.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,BaudRatePrescaler,CLKPolarity,CLKPhase,DataSize
SPI2.Mode=SPI_MODE_MASTER
SPI2.VirtualType=VM_MASTER
TIM12.Channel-Output\ Compare1\ No\ Output=TIM_CHANNEL_1
TIM12.Channel-Output\ Compare2\ No\ Output=TIM_CHANNEL_2
TIM12.IPParameters=Period,Prescaler,Channel-Output Compare1 No Output,OCMode_1,Pulse-Output Compare1 No Output,Channel-Output Compare2 No Output
TIM12.OCMode_1=TIM_OCMODE_TOGGLE
TIM12.Period=0xbb80
TIM12.Prescaler=0
TIM12.Pulse-Output\ Compare1\ No\ Output=0
TIM13.Channel=TIM_CHANNEL_1
TIM13.IPParameters=Period,Prescaler,Channel,OCMode_1,Pulse
TIM13.OCMode_1=TIM_OCMODE_TOGGLE
TIM13.Period=0xbb80
TIM13.Prescaler=0
TIM13.Pulse=0
TIM16.Channel=TIM_CHANNEL_1
TIM16.IPParameters=Channel,Period,Prescaler
TIM16.Period=0xffff
TIM16.Prescaler=4799
TIM17.Channel=TIM_CHANNEL_1
TIM17.IPParameters=Channel,Prescaler,Period
TIM17.Period=0xffff
TIM17.Prescaler=4799
TIM19.EncoderMode=TIM_ENCODERMODE_TI12
TIM19.IPParameters=EncoderMode
TIM2.Channel-PWM\ Generation1\ CH1=TIM_CHANNEL_1
TIM2.Channel-PWM\ Generation2\ CH2=TIM_CHANNEL_2
TIM2.Channel-PWM\ Generation3\ CH3=TIM_CHANNEL_3
TIM2.Channel-PWM\ Generation4\ CH4=TIM_CHANNEL_4
TIM2.IPParameters=Channel-PWM Generation1 CH1,Channel-PWM Generation2 CH2,Channel-PWM Generation3 CH3,Channel-PWM Generation4 CH4,Period,Prescaler,Pulse-PWM Generation4 CH4
TIM2.Period=0xffff
TIM2.Prescaler=0
TIM2.Pulse-PWM\ Generation4\ CH4=0
TIM4.EncoderMode=TIM_ENCODERMODE_TI12
TIM4.IPParameters=EncoderMode
TIM5.Channel-PWM\ Generation1\ CH1=TIM_CHANNEL_1
TIM5.Channel-PWM\ Generation2\ CH2=TIM_CHANNEL_2
TIM5.Channel-PWM\ Generation3\ CH3=TIM_CHANNEL_3
TIM5.Channel-PWM\ Generation4\ CH4=TIM_CHANNEL_4
TIM5.IPParameters=Channel-PWM Generation1 CH1,Channel-PWM Generation2 CH2,Channel-PWM Generation3 CH3,Channel-PWM Generation4 CH4,Period,Prescaler,Pulse-PWM Generation4 CH4
TIM5.Period=0xffff
TIM5.Prescaler=0
TIM5.Pulse-PWM\ Generation4\ CH4=0
TIM6.IPParameters=Prescaler,Period,TIM_MasterOutputTrigger
TIM6.Period=0xbb80
TIM6.Prescaler=99
TIM6.TIM_MasterOutputTrigger=TIM_TRGO_UPDATE
USART1.IPParameters=VirtualMode-Asynchronous
USART1.VirtualMode-Asynchronous=VM_ASYNC
USB_DEVICE.CLASS_NAME_FS=CDC
USB_DEVICE.IPParameters=VirtualMode,VirtualModeFS,CLASS_NAME_FS,PRODUCT_STRING_CDC_FS,USBD_SELF_POWERED
USB_DEVICE.PRODUCT_STRING_CDC_FS=STM32 Virtual ComPort
USB_DEVICE.USBD_SELF_POWERED=0
USB_DEVICE.VirtualMode=Cdc
USB_DEVICE.VirtualModeFS=Cdc_FS
VP_FATFS_VS_Generic.Mode=User_defined
VP_FATFS_VS_Generic.Signal=FATFS_VS_Generic
VP_RTC_VS_RTC_Activate.Mode=RTC_Enabled
VP_RTC_VS_RTC_Activate.Signal=RTC_VS_RTC_Activate
VP_RTC_VS_RTC_Alarm_A_Intern.Mode=Alarm A
VP_RTC_VS_RTC_Alarm_A_Intern.Signal=RTC_VS_RTC_Alarm_A_Intern
VP_RTC_VS_RTC_Alarm_B_Intern.Mode=Alarm B
VP_RTC_VS_RTC_Alarm_B_Intern.Signal=RTC_VS_RTC_Alarm_B_Intern
VP_RTC_VS_RTC_Calendar.Mode=RTC_Calendar
VP_RTC_VS_RTC_Calendar.Signal=RTC_VS_RTC_Calendar
VP_SDADC1_CONF0.Mode=ConfigZero
VP_SDADC1_CONF0.Signal=SDADC1_CONF0
VP_SDADC1_CONF1.Mode=ConfigUn
VP_SDADC1_CONF1.Signal=SDADC1_CONF1
VP_SDADC1_CONF2.Mode=ConfigDeux
VP_SDADC1_CONF2.Signal=SDADC1_CONF2
VP_SDADC2_CONF0.Mode=ConfigZero
VP_SDADC2_CONF0.Signal=SDADC2_CONF0
VP_SDADC2_CONF1.Mode=ConfigUn
VP_SDADC2_CONF1.Signal=SDADC2_CONF1
VP_SDADC2_CONF2.Mode=ConfigDeux
VP_SDADC2_CONF2.Signal=SDADC2_CONF2
VP_SDADC3_CONF0.Mode=ConfigZero
VP_SDADC3_CONF0.Signal=SDADC3_CONF0
VP_SDADC3_CONF1.Mode=ConfigUn
VP_SDADC3_CONF1.Signal=SDADC3_CONF1
VP_SDADC3_CONF2.Mode=ConfigDeux
VP_SDADC3_CONF2.Signal=SDADC3_CONF2
VP_SYS_VS_Systick.Mode=SysTick
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
VP_TIM12_VS_ClockSourceINT.Mode=Internal
VP_TIM12_VS_ClockSourceINT.Signal=TIM12_VS_ClockSourceINT
VP_TIM12_VS_no_output1.Mode=Output Compare1 No Output
VP_TIM12_VS_no_output1.Signal=TIM12_VS_no_output1
VP_TIM12_VS_no_output2.Mode=Output Compare2 No Output
VP_TIM12_VS_no_output2.Signal=TIM12_VS_no_output2
VP_TIM13_VS_ClockSourceINT.Mode=Enable_Timer
VP_TIM13_VS_ClockSourceINT.Signal=TIM13_VS_ClockSourceINT
VP_TIM13_VS_no_output1.Mode=Output Compare1 No Output
VP_TIM13_VS_no_output1.Signal=TIM13_VS_no_output1
VP_TIM16_VS_ClockSourceINT.Mode=Enable_Timer
VP_TIM16_VS_ClockSourceINT.Signal=TIM16_VS_ClockSourceINT
VP_TIM17_VS_ClockSourceINT.Mode=Enable_Timer
VP_TIM17_VS_ClockSourceINT.Signal=TIM17_VS_ClockSourceINT
VP_TIM2_VS_ClockSourceINT.Mode=Internal
VP_TIM2_VS_ClockSourceINT.Signal=TIM2_VS_ClockSourceINT
VP_TIM5_VS_ClockSourceINT.Mode=Internal
VP_TIM5_VS_ClockSourceINT.Signal=TIM5_VS_ClockSourceINT
VP_TIM6_VS_ClockSourceINT.Mode=Enable_Timer
VP_TIM6_VS_ClockSourceINT.Signal=TIM6_VS_ClockSourceINT
VP_USB_DEVICE_VS_USB_DEVICE_CDC_FS.Mode=CDC_FS
VP_USB_DEVICE_VS_USB_DEVICE_CDC_FS.Signal=USB_DEVICE_VS_USB_DEVICE_CDC_FS
board=custom
isbadioc=false
